<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Constants
    |--------------------------------------------------------------------------
    |
    */

    'constant' => '常數',

    'condition' => [
        '='  => 'A 等於 B',
        '!=' => 'A 不等於 B',
        '<'  => 'A 小於 B',
        '<=' => 'A 小於或等於 B',
        '>'  => 'A 大於 B',
        '>=' => 'A 大於或等於 B',
        'in'     => 'A 在 B 裡',
        'not in' => 'A 不在 B 裡',
        '&&'     => 'A 而且 B',
        '||'     => 'A 或 B'
    ],
    'dataType' => [
        'array'          => '陣列',
        'boolean'        => '布林值',
        'datetime'       => '時間',
        'int'            => '整數',
        'int_positive'   => '整數 (Positive)',
        'int_unsigned'   => '整數 (Unsigned)',
        'float'          => '浮點數',
        'float_positive' => '浮點數 (Positive)',
        'float_unsigned' => '浮點數 (Unsigned)',
        'json'           => 'JSON',
        'string'         => '字串',
        'xml'            => 'XML'
    ],
    'filter' => [
        '*'  => '每一個',
        '/'  => '只限第 :value 個',
        '/+' => '每隔 :value 個',
        '/~' => '所有大於第 :value 個',
        '~/' => '所有小於第 :value 個'
    ],
    'operator' => [
        '='  => '賦予',
        '+=' => '加上後賦值',
        '-=' => '減去後賦值',
        '*=' => '乘以後賦值',
        '/=' => '除以後賦值',
        'after'   => '放在目標後面',
        'append'  => '插入至目標最尾段',
        'before'  => '放在目標前面',
        'prepend' => '插入至目標最前段'
    ]
];
